#include<stdio.h>
#include<locale.h>
#include<iostream>
#include<math.h>
	
//	&& - and
//	|| - or
//	!  - not
//	== - Левый оператор равен правому
//	!= - Левый оператор не равен правому
//	В if() всегда использовать ==
//  pow(x,6) Степень 6
//  sqrt(64) Корень 64
//  abs(-4) Модуль -4, то есть равен 4

int main()
{
	setlocale(LC_ALL, "");

	////5.	Идет k - я секунда суток.Определить, сколько целых часов(Н) и целых минут(М) прошло с начала суток.
	////	Вывести на экран фразу : «Эточасовминут».Вместо многоточий поставить вычисленные значения Н и М.

	//float S, M, H;
	//printf("Секунд = ");
	//scanf_s("%f", &S);

	//M = S / 60;
	//printf("Минуты = ");
	//printf("%f\n", M);

	//H = (S / 60)/60;
	//printf("Минуты = ");
	//printf("%f\n", H);


	////4.	Вычислить рентабельность работы предприятия за месяц по формуле рент = прибыль / себестоимость100 % ,
	////	если себестоимость продукции в текущем месяце уменьшилась по сравнению с прошлым на 5 % .
	////	Значение прибыли и себестоимости за прошлый месяц ввести с экрана

	//float P, S;
	//printf("Прибыль = ");
	//scanf_s("%f", &P);

	//printf("Себестоимость = ");
	//scanf_s("%f", &S);

	//float R = (P / S) * 0.95;
	//printf("Рентабельность = ");
	//printf("%f\n", R);





	////2.	Найти корни квадратного уравнения a·x2 + b·x + c = 0,
	////	введя с экрана коэффициенты a, b, c(коэффициент a не равен 0)
	////	, для которых дискриминант положителен.

	//float X = 0, a, b, c, D, x1, x2;
	//printf("a(не может быть равен 0) = ");
	//scanf_s("%f", &a);

	//printf("b = ");
	//scanf_s("%f", &b);

	//printf("c = ");
	//scanf_s("%f", &c);
	//
	//D = pow(b, 2) - 4 * a*c;
	//printf("Discriminant = ");
	//printf("%f\n", D);

	//x1 = (-(b)+sqrt(D)) / 2 * a;
	//printf("Первый корень = ");
	//printf("%f\n", x1);

	//x2 = (-(b)-sqrt(D)) / 2 * a;
	//printf("Второй корень = ");
	//printf("%f\n", x2);

	//X = a * pow(x1, 2) + b * x1 + c;
	//printf("X = ");
	//printf("%f\n", X);



	////1.	Тело движется по закону S = t3 – 3t2 + 2. Вычислить скорость тела в момент времени t.
	////	Значение t ввести с клавиатуры(Функция скорости есть производная от функции расстояния по времени).

	//float t;
	//printf("Time = ");
	//scanf_s("%f", &t);

	//float S = pow(t, 3) - 3 * pow(t, 2) + 2;
	//printf("%f\n", S);


	//17
	//float x = 8.52, c = 9, a, b, y;
	//b = pow(log(abs(x)), 2);
	//printf("%f\n", b);
	//a = pow(sqrt(abs(b + c)), 3);
	//printf("%f\n", a);
	//y = pow(cos(b), 2) + b * pow(cos(pow(a, 2)), 4);
	//printf("%f\n", y);

	//16
	//float x = 8.52, c = 9, a, b, y;
	//b = x + pow(c, 2);
	//printf("%f\n", b);
	//a = pow(sqrt(abs(b + c)), 3);
	//printf("%f\n", a);
	//y = pow(cosf(b), 2) + b * pow(cosf(pow(a, 2)), 4);
	//printf("%f\n", y);


	//3
	//float x = 2.1, p = 1;
	//float a = exp(sqrt(x));
	//printf("%f\n", a);
	//float b = sinf(pow(1, 2) + pow(x, 3));
	//printf("%f\n", b);
	//float y = pow(a, 3) / pow(b, 2);
	//printf("%f\n", y);

	//2
	//float x = 1.3;
	//float a = (float)log(x);
	//printf("%f\n", a);
	//float b = exp(2*x) + a * x;
	//printf("%f\n", b);
	//float y = x * pow(a, 3) + pow(b, 2);
	//printf("%f\n", y);


	///*1.	Дана величина Z, выражающая объем информации в байтах.Перевести Z в более крупные единицы измерения информации*/

	//int Z;
	//scanf_s("%d", &Z);
	//float X = (float)Z / 1024;
	//printf("%f\n", X);
	//float Y = (float)X / 1024;
	//printf("%f\n", Y);

	////2.	Задано расстояние L в сантиметрах.Найти количество полных метров в нем, используя операцию деления нацело.

	//int L;
	//printf("Сантиметры = ");
	//scanf_s("%d", &L);

	//float M = (float)L / 100;
	//printf("%f\n", M);




	////3.	С начала суток прошло N секунд(N — целое).Найти количество полных минут, прошедших с начала суток.
	//int N;
	//printf("Секунд прошло = ");
	//scanf_s("%d", &N);

	//float M = (float)N / 60;
	//printf("%f\n", M);



	//4.	Даны два неотрицательных числа a и b.Найти их среднее геометрическое.

	//int a, b;
	//printf("Первое число = ");
	//scanf_s("%d", &a);

	//printf("Второе число = ");
	//scanf_s("%d", &b);
	//
	//float c = (float)a * b;
	//float d =sqrt(c);

	//printf("%f\n", d);

	//int a, b;
	//printf("Первая сторона прямоугольника = ");
	//scanf_s("%d", &a);

	//printf("Вторая сторона прямоугольника = ");
	//scanf_s("%d", &b);

	//int per = 2 * a + 2 * b;
	//printf("Периметр = ");	
	//printf("%d\n", per);

	//int plo = a * b;
	//printf("Площадь = ");
	//printf("%d\n", plo);

	system("pause");
}